# 2번.py
try:
        import sys
except:
        print("모듈을 임포트하지 못했습니다.")

# 이름을 출력할 때 사용할 폰트 지정
font1=[
    [1,0,1,0,1,0,1,0,0,0,0,0,1],
    [0,0,0,0,0,1,0,0,0,0,0,0,1],
    [0,0,0,0,1,0,0,0,0,0,0,0,1],
    [0,0,0,1,0,1,0,0,1,0,1,0,1],
    [0,0,1,0,0,0,1,0,0,0,0,0,1],
    [0,1,0,0,0,0,0,1,0,0,0,0,1],
    [1,0,0,0,0,0,0,0,1,0,0,0,1],
    [0,1,0,1,0,1,0,1,0,1,0,1,0],
    [1,0,0,0,0,0,0,0,0,0,0,0,1],
    [1,0,0,0,0,0,0,0,0,0,0,0,1],
    [0,1,0,1,0,1,0,1,0,1,0,1,0],

]

font2=[
    [0,0,0,0,0,0,1,0,0,0,0,0,0],
    [0,0,0,0,0,1,0,1,0,0,0,0,0],
    [0,0,0,0,1,0,0,0,1,0,0,0,0],
    [0,0,0,1,0,0,0,0,0,1,0,0,0],
    [0,0,1,0,0,0,0,0,0,0,1,0,0],
    [0,1,0,0,0,0,0,0,0,0,0,1,0],
    [0,0,0,0,0,0,0,0,0,0,0,0,0],
    [1,0,1,0,1,0,1,0,1,0,1,0,1],
    [0,0,0,0,0,0,1,0,0,0,0,0,0],
    [0,0,0,0,0,0,1,0,0,0,0,0,0],
    [0,0,0,0,0,0,1,0,0,0,0,0,0],

]

font3=[
    [0,0,0,1,0,1,0,1,0,0,0,0,1],
    [0,1,0,0,0,0,0,0,0,1,0,0,1],
    [1,0,0,0,0,0,0,0,0,0,1,0,1],
    [1,0,0,0,0,0,0,0,0,0,1,0,1],
    [1,0,0,0,0,0,0,0,0,0,1,0,1],
    [0,1,0,0,0,0,0,0,0,1,0,0,1],
    [0,0,0,1,0,1,0,1,0,0,0,0,1],
    [1,0,0,0,0,0,0,0,0,0,0,0,0],
    [1,0,0,0,0,0,0,0,0,0,0,0,0],
    [1,0,0,0,0,0,0,0,0,0,0,0,0],
    [1,0,1,0,1,0,1,0,1,0,1,0,1],

]

# 이름을 출력하는 함수를 정의.
def print_name():
        # 각 폰트의 가로행들끼리 모아서 한 줄씩 출력하여
        # 폰트 3개가 가로로 출력될 수 있게 한다.
        for height in range(0,11):
            name = font1[height]+font2[height]+font3[height]

            # 사용자가 입력한 문자로 폰트의 글자를 바꿈
            # 단 줄바꿈이 일어나는 시점인 행의 마지막 글자에서는
            # \n가 포함되어 출력되는 print 함수 이용
            # 마지막 문자가 아닐 때는 줄이 바뀌면 안되니까 sys 함수 이용
            for width in range(0,39):
                if name[width] == 1:
                    if width == 38:
                        print(user_char)
                    else:
                        sys.stdout.write(user_char)
                elif name[width] == 0:
                    if width == 38:
                        sys.stdout.write("\n")
                    else:
                        sys.stdout.write(" ")
    


print("┌───────────────────┐")
print("│나의 이름을 출력하는 프로그램입니다.  │")
print("│Menu 1: 프로그램을 시작합니다.        │")
print("│Menu 2: 프로그램을 종료합니다.        │")
print("└───────────────────┘")

# 계속 루프를 돌며 종료 입력을 받으면 프로그램 종료
while(True):
    try:
        menu = int(input("\n1: 계속\n2: 종료\n메뉴를 골라주세요:\n"))
        if (menu == 1 ):
            pass
        elif (menu == 2):
            print("프로그램을 종료합니다.\n")
            break
        else:
            print("1과 2 중에 한 가지만 입력해주십시오.\n")
            continue
            
    except:
        print("1과 2 중에 한 가지만 입력해주십시오.\n")
        continue

    print("┌───────┐")
    print("│예: @ # = + . │")
    print("└───────┘")

    # 사용자에게 사용할 문자를 입력 받는다.
    # 한 글자만 입력되도록 입력되는 문자열의 크기를 계산한다.
    user_char = input("이름을 출력할 때 사용할 문자를 선택합니다.\n위의 예시와 같은 문자 하나를 입력하세요.\n")
    if len(user_char) != 1:
        print("한 글자만 입력해주세요.")
        continue
    else:
        print_name()
    
    



    
